In [1]:
import pandas as pd 
import numpy as np
from pandas import Series, DataFrame

In [4]:
dframe = DataFrame({'key1':['X','X','Y','Y','Z'],'key2':['alpha','beta','alpha','beta','alpha'],
                   'data_set1':np.random.randn(5),'data_set2':np.random.randn(5)})
dframe

  key1   key2  data_set1  data_set2
0    X  alpha   0.132747   1.230768
1    X   beta  -1.314593  -0.810976
2    Y  alpha   0.067335  -2.976148
3    Y   beta  -0.236479  -1.707760
4    Z  alpha   0.152146   0.788764

In [5]:
group1 = dframe['data_set1'].groupby(dframe['key1'])
group1

In [6]:
group1.mean()

key1
X   -0.590923
Y   -0.084572
Z    0.152146
Name: data_set1, dtype: float64

In [7]:
cities = np.array(['LA','NY','NY','LA','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe['data_set1'].groupby([cities,month]).mean()

LA  FEB   -0.236479
    JAN    0.132747
NY  FEB   -1.314593
    JAN    0.109741
Name: data_set1, dtype: float64

In [9]:
dframe

  key1   key2  data_set1  data_set2
0    X  alpha   0.132747   1.230768
1    X   beta  -1.314593  -0.810976
2    Y  alpha   0.067335  -2.976148
3    Y   beta  -0.236479  -1.707760
4    Z  alpha   0.152146   0.788764

In [10]:
dframe.groupby('key1').mean()

      data_set1  data_set2
key1
X     -0.590923   0.209896
Y     -0.084572  -2.341954
Z      0.152146   0.788764

In [11]:
dframe.groupby(['key1','key2']).mean()

            data_set1  data_set2
key1 key2
X    alpha   0.132747   1.230768
     beta   -1.314593  -0.810976
Y    alpha   0.067335  -2.976148
     beta   -0.236479  -1.707760
Z    alpha   0.152146   0.788764

In [12]:
dframe.groupby(['key1']).size()

key1
X    2
Y    2
Z    1
dtype: int64

In [14]:
dframe

  key1   key2  data_set1  data_set2
0    X  alpha   0.132747   1.230768
1    X   beta  -1.314593  -0.810976
2    Y  alpha   0.067335  -2.976148
3    Y   beta  -0.236479  -1.707760
4    Z  alpha   0.152146   0.788764

In [39]:
for name,group in dframe.groupby('key1'):
    print ("this is the {0} group".format(name))
    print (group)
    print ('\n')

this is the X group
  key1   key2  data_set1  data_set2
0    X  alpha   0.132747   1.230768
1    X   beta  -1.314593  -0.810976


this is the Y group
  key1   key2  data_set1  data_set2
2    Y  alpha   0.067335  -2.976148
3    Y   beta  -0.236479  -1.707760


this is the Z group
  key1   key2  data_set1  data_set2
4    Z  alpha   0.152146   0.788764

In [37]:
for (key1,key2), group in dframe.groupby(['key1','key2']):
    print('Key1 = {0} Key2= {1}'.format(key1,key2))
    print(group)
    print('\n')

Key1 = X Key2= alpha
  key1   key2  data_set1  data_set2
0    X  alpha   0.132747   1.230768


Key1 = X Key2= beta
  key1  key2  data_set1  data_set2
1    X  beta  -1.314593  -0.810976


Key1 = Y Key2= alpha
  key1   key2  data_set1  data_set2
2    Y  alpha   0.067335  -2.976148


Key1 = Y Key2= beta
  key1  key2  data_set1  data_set2
3    Y  beta  -0.236479   -1.70776


Key1 = Z Key2= alpha
  key1   key2  data_set1  data_set2
4    Z  alpha   0.152146   0.788764

In [40]:
group_dict  = dict(list(dframe.groupby('key1')))
group_dict['X']

  key1   key2  data_set1  data_set2
0    X  alpha   0.132747   1.230768
1    X   beta  -1.314593  -0.810976

In [41]:
#same as last cell
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
group_dict_axis1 #separate by datatypes

{dtype('float64'):    data_set1  data_set2
 0   0.132747   1.230768
 1  -1.314593  -0.810976
 2   0.067335  -2.976148
 3  -0.236479  -1.707760
 4   0.152146   0.788764, dtype('O'):   key1   key2
 0    X  alpha
 1    X   beta
 2    Y  alpha
 3    Y   beta
 4    Z  alpha}

In [44]:
dataset2_group = dframe.groupby(['key1','key2'])[['data_set2']]
dataset2_group.mean()

            data_set2
key1 key2
X    alpha   1.230768
     beta   -0.810976
Y    alpha  -2.976148
     beta   -1.707760
Z    alpha   0.788764

In [45]:
dframe

  key1   key2  data_set1  data_set2
0    X  alpha   0.132747   1.230768
1    X   beta  -1.314593  -0.810976
2    Y  alpha   0.067335  -2.976148
3    Y   beta  -0.236479  -1.707760
4    Z  alpha   0.152146   0.788764